//Привет, object

/*
Напишите код, выполнив задание из каждого пункта отдельной строкой:

    Создайте пустой объект user.
    Добавьте свойство name со значением John.
    Добавьте свойство surname со значением Smith.
    Измените значение свойства name на Pete.
    Удалите свойство name из объекта.
*/

//решение

let user = {}; //создать пустой объект user
user.name = "John"; //Добавьте свойство name со значением John
user.surname = "Smith"; //Добавьте свойство surname со значением Smith.
user.name = "Pete"; //Измените значение свойства name на Pete.
delete user.name; //Удалите свойство name из объекта.